Revit 2027 API
BuiltInFailures.RebarCouplerFailures.MainEngagementParameterError Property
 This is used to post error. "Bar Engagement 1" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MainEngagementParameterError { get; }
Public Shared ReadOnly Property MainEngagementParameterError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MainEngagementParameterError {
	FailureDefinitionId^ get ();
}
static member MainEngagementParameterError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace